In [1]:
import sqlite3
import pandas as pd
import sqlalchemy

In [2]:
engine = sqlalchemy.create_engine('sqlite:///OurDataBase.db')

In [3]:
pd.read_sql('employees', engine) # you can use SQL statement in the first '' too :)

     name   surname     salary
0     Max   Maxwell   100000.0
1    Anna     White  1000000.0
2  Denzel  Sullivan  1000000.0

In [4]:
df1 = pd.DataFrame([{'name': 'Maxwell', 'surname':'Foster', 'salary':120000.00}])

In [5]:
df1

      name surname    salary
0  Maxwell  Foster  120000.0

In [6]:
df1.to_sql('employees', engine, if_exists='append',index=False) #to_sql creates a whole new table, so you cant do that

1

In [7]:
pd.read_sql('employees',engine)

      name   surname     salary
0      Max   Maxwell   100000.0
1     Anna     White  1000000.0
2   Denzel  Sullivan  1000000.0
3  Maxwell    Foster   120000.0